￥
･
～
＿
Ｑ
？
＞
＝
；
：
．
－
，
＋
）
（
％
＃
＂
！
﹉
️


龄
齐
鼓
鼎
默
黑
黄
麽
麼
麻
鹅
鸡
鸟
鳓
鲁
魅
鬼
高
骨
骤
骗
骑
验
骂
马
驗
馬
香
首
馈
饿
饭
餐
飞
风
额
颜
题
颗
颖
颔
频
领
预
顿
须
顺
项
页
顯
額
題
頟
須
音
鞡
面
靠
非
静
靖
靓
青
露
需
電
零
雨
集
难
隨
障
隔
隐
随
陪
险
除
院
限
降
陆
际
附
阿
阶
阳
防
队
阅
闹
闷
间
问
闭
闪
门
間
開
长
镜
镇
键
错
锁
销
链
铺
银
钻
钱
钰
钮
钟
针
鐘
錯
錢
銷
銀
鉴
金
量
重
里
释
采
醒
醉
酸
酷
配
都
郭
部
郁
邮
邦
那
還
邀
避
遲
遨
遥
遗
道
過
遍
遇
逾
逼
造
速
通
這
途
递
逐
透
选
适
送
退
追
迷
述
迟
连
违
远
进
这
还
返
近
运
过
迅
迂
迁
达
边
辰
辨
辣
辛
输
辆
较
载
轻
软
轮
转
车
轉
載
身
跳
路
跪
跨
跟
跑
趴
足
趣
趋
越
超
起
赶
走
赢
赠
赞
赛
赚
赖
赔
赎
资
贻
费
贷
贵
购
质
货
账
败
责
财
贡
负
賬
資
費
貸
貨
貌
象
谱
谢
谈
谅
调
谁
读
请
诶
说
误
语
详
该
询
诞
话
试
诏
诉
诈
识
评
证
访
设
论
许
讲
记
讯
议
训
让
讨
认
订
计
警
證
請
誰
說
誤
誉
話
証
記
計
言
解
角
觉
览
视
规
见
見
要
西
装
被
袋
衰
表
补
衣
衡
行
融
蛮
蛋
蚌
蚊
蚂
蚁
號
虚
虑
薪
薇
蔽
蓝
蓄
董
营
菜
获
莲
莱
莫
莪
莞
荐
草
茗
范
苹
英
苦
若
苏
花
芯
芝
节
艹
色
良
般
舍
與
致
至
自
腾
腻
脸
脑
脉
能
胡
胞
背
胁
育
肯
股
聚
联
职
聋
聊
耽
耻
耶
而
者
考
老
群
羞
美
署
罰
置
罚
罗
网
罐
缺
缴
缩
缘
编
缓
综
维
续
绪
继
统
绝
络
给
结
绑
经
绍
终
细
线
纸
纵
纳
纯
纪
级
约
红
纠
續
繼
繁
經
綁
統
給
絡
結
紹
累
紧
索
素
紅
系
糟
糗
糕
粹
粒
类
米
箱
管
算
简
签
筹
策
答
等
筆
第
笫
符
笔
笑
端
章
竟
竞
站
立
窗
突
穿
空
究
稳
稍
程
移
称
积
租
秘
秒
科
种
秋
私
秀
离
福
禁
票
祥
神
社
礼
示
磨
磁
碼
確
碰
确
破
码
短
知
矢
矛
瞎
睡
着
眾
眼
真
看
眉
省
盾
盼
相
直
目
盜
盘
盗
盖
监
益
盈
皮
皇
皆
的
百
白
發
登
痹
痛
病
疼
疷
疑
疏
略
留
界
畅
画
男
电
申
由
用
生
甚
理
球
現
班
珠
珍
现
环
玩
玛
率
獲
猴
献
猫
猜
狠
狂
狀
状
特
牵
物
牡
牙
版
片
爹
爸
爷
父
爱
燎
燃
熟
照
然
热
烫
烦
烈
為
点
炖
炒
灰
灭
火
灣
激
澳
澡
漏
滴
满
滞
滚
源
湾
湘
湖
游
港
渠
清
添
混
深
淘
涩
涨
润
消
海
浮
浦
济
测
流
派
活
洛
洗
泪
注
波
法
泄
油
河
没
沟
沙
沒
汽
決
江
汗
汉
汇
求
永
水
气
民
氏
毛
毕
比
毒
每
母
段
殊
死
歹
步
此
正
止
歌
歉
歀
款
欺
欹
欢
次
欠
機
樣
模
標
槛
榜
概
業
楚
棒
检
梯
梨
條
梆
桶
桌
案
框
格
根
核
样
校
栏
标
查
柜
染
某
架
果
林
构
极
板
松
来
条
束
村
材
权
杂
杀
机
朵
术
本
末
未
木
期
望
服
朋
有
月
會
最
替
曾
更
曰
暴
暂
智
景
普
晨
晚
晕
晒
時
显
昵
是
昨
春
映
星
易
明
时
旬
早
旧
旦
日
既
无
旗
旅
方
新
斯
断
斤
料
斗
文
整
数
散
敢
教
敗
救
敉
效
故
政
放
攻
改
收
支
攀
擦
操
撸
播
撤
撞
撒
撇
摊
摇
摄
携
搬
搞
搜
搁
援
揭
換
插
提
描
推
控
接
探
掘
排
掉
授
捿
捷
据
捣
换
损
捐
捏
捉
捆
挽
挺
挷
挖
挑
按
指
挂
持
拿
括
择
拨
拦
拥
拟
拜
招
拖
拔
拒
拍
拉
拆
担
抽
押
抵
抱
抬
报
护
抢
抠
折
投
抓
把
技
承
找
批
扰
扫
扩
执
扣
托
打
扎
才
手
所
房
户
戶
戴
截
或
戒
我
成
戏
懵
應
懂
憾
慢
慌
態
愿
感
意
愈
想
惠
惜
惑
情
您
悦
患
悠
悔
悉
悄
恶
恵
恳
息
恭
恩
恢
总
怪
性
急
思
怜
怕
怒
怎
态
怀
忽
念
快
忙
忘
志
必
心
徽
徼
德
徴
微
循
從
得
徒
律
很
待
径
征
往
彻
影
彩
录
当
归
强
弹
弧
张
弟
引
式
弄
异
开
建
延
座
度
废
府
店
底
应
序
庆
广
幾
幽
幼
并
年
平
干
幅
常
帳
帮
席
带
帐
希
师
布
市
币
巻
巴
巳
已
己
差
巧
左
工
州
峰
岛
岂
岁
岀
山
履
属
展
屏
屋
届
居
层
屁
局
尾
尽
尼
尴
就
尬
尝
尚
尔
少
小
将
封
寿
导
对
察
寒
富
密
寄
宾
宽
容
家
害
客
审
实
宝
宜
定
官
宗
完
安
守
它
宁
孩
学
季
存
字
子
嫖
婆
娶
娟
娘
威
委
姓
姑
姐
始
妹
妳
妈
如
好
她
女
套
奖
奈
奇
夸
头
失
夫
太
天
大
够
夜
多
外
夕
夏
复
备
处
壳
声
士
壋
壁
增
填
塘
塊
堤
堆
基
培
埭
埠
域
型
垃
坞
坚
块
坑
坐
坏
均
址
圾
场
圳
地
在
圣
圖
國
圈
图
国
固
围
困
囯
园
团
因
回
四
嚒
噻
器
噢
嘿
嘴
嘞
嘛
嘎
嘉
嗯
嗨
嗎
單
喜
喔
喊
善
喃
啦
啥
問
啊
商
唯
售
唔
唉
哭
哪
哩
哦
哥
哟
哒
哑
哎
响
哈
哇
品
咱
咯
咩
咨
咧
咙
咒
和
咋
咁
呼
呻
呵
味
呲
周
呦
呢
员
呗
呐
告
呆
呃
呀
吿
吹
吵
吱
启
听
含
吧
否
吞
吗
吖
向
后
名
同
吋
吉
合
各
吃
叽
司
号
右
史
台
可
叫
只
叧
另
句
古
口
变
受
取
发
反
双
友
及
又
参
县
去
原
厚
厘
厕
压
厉
历
卸
卷
却
即
危
印
卫
卡
占
博
南
卖
单
卓
协
华
半
午
升
千
十
医
区
匹
北
化
包
勿
動
勒
勇
势
劵
劲
努
助
动
劣
务
加
功
办
力
剪
剩
剛
前
刻
券
刷
制
到
别
刪
利
判
删
初
创
刚
则
列
划
切
分
函
击
出
凭
几
减
凌
准
净
冻
况
决
冲
冠
农
军
写
再
册
冇
内
养
具
其
兴
关
共
六
公
八
兩
全
內
入
兑
免
克
光
先
充
元
允
儿
優
像
傻
傲
催
储
傍
偿
偷
偶
停
做
偏
假
值
债
倦
借
候
倒
們
倍
個
俺
俱
修
俩
信
保
俄
係
便
侯
侧
依
供
例
來
侄
使
佰
佣
你
作
余
何
体
住
低
位
但
似
伸
伴
估
伦
伤
传
伟
会
伙
优
众
休
企
份
任
价
件
们
仧
以
令
代
仟
付
他
仓
从
仍
介
今
仅
什
人
亲
京
享
产
交
亡
些
亚
五
互
云
亏
于
二
事
争
予
了
乱
买
书
乡
习
也
九
乘
乐
乍
之
义
么
久
乃
举
丽
主
为
丹
丶
临
中
丫
个
丨
严
两
丢
东
业
世
且
专
与
不
下
上
三
万
七
一
䃼
の
っ
】
【
》
《
〉
〈
。
、
　
⋯
⊙
→
⃣
‭
‬
…
•
”
“
‘
—
‍
 
 
ิ
ϖ
÷
·
°
~
|
z
y
x
w
v
u
t
s
r
q
p
o
n
m
l
k
j
i
h
g
f
e
d
c
b
a
_
^
]
\
[
Y
X
W
V
U
T
S
R
Q
P
O
N
M
L
K
J
I
H
G
F
E
D
C
B
A
@
?
>
=
<
;
:
9
8
7
6
5
4
3
2
1
0
/
.
-
,
+
*
)
(
'
%
$
#
"
!
